/*
    Интерфейс сервера для приема и передачи данных по сети.
    Команды для запроса с клиентского приложения:
    1. MT_CONNECT   - подключение к серверу и запрос списка пользователей.
    2. MT_SEND_TO   - Отправка сообщения/файла указанному пользователю.
    3. MT_SEND_ALL  - Отправка сообщения/файла всем пользователям.
    4. MSG_TEXT     - Указать, если отправляется текстовое сообщение.
    5. MSG_FILE     - Указать, если отправляется файл.
    Команды отправлять по следующему шаблону:
    <1-3>|<4-5>|<имя пользователя>|<сообщение>
    Символ "|" запрещен для отправки в сообщении.
*/
#include <unistd.h>
#define PORT 1000            // Порт для обмена данными.
#define CLIENTS_QUANTITY 20  // Количество одновременных пользователей.
#define BUFFER_SIZE 0x100000 // Количество байт, отправляемых за раз.
#define REQUEST_SIZE 0x400

/*
    Структура пакета с полем для данных
    и сокетом для отправки этих данных.
*/
typedef struct user
{
    char answer[REQUEST_SIZE];
    char username[255];
    struct user *next, *prev;
    int recv_socket;
} user;

/* Инициализация сервера. */
void init();
/* Функция установки соединения с клиентскими компьютерами. */
void set_connect();
/*
    Функция реализации протокола приема и передачи данных по сети.
*/
void *send_reveive_protocol(void *arg);